Repository: radyemam/Bird-ads.com
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Location
ar: المناطق

# link_post
source: Post Link
ar: المنشور

# text_post
source: Post Text
ar: نص المنشور

# image_post
source: Images
ar: الصور

# view_all_ads
source: View all advertisements
ar: استعراض جميع الإعلانات

source: Show Ads
ar: اعرض الإعلانات

# ad_number
source: Ad Number {adNumber}: {adName}
ar: إعلان رقم {adNumber}: {adName}

# ad_status
source: Ad Status: {status}
ar: حالة الإعلان: {status}

source: Resume Ad
ar: استكمال الإعلان

source: Provide Budget
ar: تزويد الميزانية

source: Provide Duration
ar: تزويد عدد الايام

source: Enter Duration
ar: أدخل عدد الايام

# error_specify_amount_days
source: Please specify the amount and days
ar: برجاء تحديد المبلغ والايام

# current_balance
source: Your current balance is {balance} EGP. Please recharge to resume the ad.
ar: رصيدك الحالي هو {balance} ج.م. برجاء الشحن لاستكمال الإعلان.

# complete_ad_success
source: Ad successfully resumed
ar: تم استكمال الإعلان بنجاح

# complete_ad_error
source: An error occurred while resuming the ad
ar: حدث خطأ أثناء استكمال الإعلان

# customer_request_error
source: An error occurred while saving the customer request
ar: حدث خطأ أثناء حفظ طلب العميل

# age_range
source: Age: From {ageFrom} to {ageTo}
ar: العمر: من {ageFrom} إلى {ageTo}

# duration_days
source: Duration: {duration} days
ar: المدة: {duration} أيام

# locations
source: Locations: {locations}
ar: المناطق: {locations}

source: Post: {link}
ar: المنشور: {link}

source: Post: {text}
ar: المنشور: {text}

# post_images
source: Images: {images}
ar: الصور: {images}

# resume_request_success
source: Resume request sent successfully. Execution will take place within two working hours
ar: تم ارسال طلب استكمال الإعلان بنجاح سيتم التنفيذ خلال ساعتين عمل

source: New Request
ar: طلب جديد

# request_note
source: Resume ad request with budget {budget} EGP and duration {duration} days
ar: طلب استكمال اعلان بقيمة {budget} ج.م ومدة {duration} أيام

# request_status
source: Ad Increase Request
ar: طلب تزويد اعلان

# email_loaded
source: Email loaded: {email}
ar: تم تحميل البريد الإلكتروني: {email}

# ads_loaded
source: Ads loaded: {count}
ar: تم تحميل الإعلانات: {count}

source: Status
ar: حالة الإعلان

# age_from_to
source: Age: from {ageFrom} to {ageTo}
ar: العمر: من {ageFrom} إلى {ageTo}

source: Post
ar: المنشور

source: Images
ar: الصور

source: Previous
ar: السابق

source: Next
ar: التالي

# error_message_no_email
source: No email found in SharedPreferences
ar: لم يتم العثور على بريد إلكتروني في التفضيلات

# error_loading_email
source: Error loading user email
ar: خطأ في تحميل البريد الإلكتروني

# error_loading_balance
source: Error loading user balance
ar: خطأ في تحميل الرصيد

source: Create
ar: إنشاء

source: Wallet
ar: المحفظة

source: know_more
ar: أعرف المزيد

source: days
ar: المدة

source: Edit Ad
ar: تعديل الاعلان

# request_targeting_change
source: Request Targeting Change to Improve Results
ar: طلب تعديل علي الاستهداف لتحسين النتائج

source: Targeting Change
ar: تعديل الاستهداف

# targeting_change_note
source: Using this request will put the ad into review mode. It should only be used if the ad results are poor.
ar: استخدام هذا الطلب يدخل الاعلان في مرحلة المراجعة يتم استخدامه في حالة ان الاعلانات نتيجتها سيئة فقط.

# targeting_change_sent
source: The targeting change request has been sent to the administration. Please follow the notifications.
ar: تم إرسال طلب تعديل الاستهداف إلى الإدارة. برجاء متابعة الإشعارات.

source: Other Edit
ar: تعديل اخر

# other_edit_prompt
source: Please write the edits and notes you want
ar: برجاء كتابة التعديل والملاحظات التي ترغب بها

# enter_edit_details
source: Enter your edits here...
ar: اكتب تعديلاتك هنا...

# other_edit_note
source: Edit the ad to
ar: تعديل الاعلان الي

# edit_request_sent
source: The edit request has been sent to the administration. Please follow the notifications.
ar: تم إرسال طلب التعديل إلى الإدارة. برجاء متابعة الإشعارات.

# enter_edit_details_error
source: Please write the edits before sending the request.
ar: برجاء كتابة التعديلات قبل إرسال الطلب.

source: Success
ar: تم بنجاح

# current_ad_id_not_found
source: Error: currentAdId not found in user document
ar: خطأ: لم يتم العثور على معرف الإعلان الحالي في مستند المستخدم

# user_is_null
source: Error: user is null
ar: خطأ: المستخدم غير موجود

# edit_duration_budget
source: Edit Ad Duration and Budget
ar: مدة وميزانية الإعلان

# set_duration_budget
source: Set Ad Duration and Budget
ar: حدد مدة وميزانية الإعلان

source: Ad Duration (days)
ar: مدة الإعلان (بالأيام)

source: Ad Budget (EGP)
ar: ميزانية الإعلان (بالجنيه المصري)

# google_youtube_fee
source: If you select a Google or YouTube ad, an additional 10% fee will be applied. The total amount to be deducted is {totalBudget} EGP.
ar: في حالة اختيار اعلان جوجل او يوتيوب يتم خصم 10% اضافية عمولة تدابير عملة. المبلغ الذي سيتم خصمه هو {totalBudget} جنيه.

# min_budget_warning
source: The minimum ad budget is 200 EGP *
ar: أقل إعلان يبدأ من 200 جنيه *

# balance_warning
source: Your current balance is {currentBalance} EGP. Please top up to complete the ad.
ar: رصيدك الحالي {currentBalance} جنيه. برجاء الشحن لتكملة الإعلان.

# ad_cost_transaction
source: Ad Cost
ar: تكلفة إعلان

source: Select Video
ar: تحديد الفيديو

source: Regions
ar: المناطق

# select_video_or_add
source: Select or Add
ar: اختر أو أضف

source: Post content selected
ar: تم اختيار منشور

source: Please select target locations
ar: يرجى تحديد أماكن الاستهداف

source: Transferred Amount
ar: المبلغ المحول

# phone_or_instapay
source: Phone Number or Instapay
ar: رقم الهاتف أو الإنستاباي المحول منه

# attachment_required
source: Please attach a transfer receipt.
ar: يرجى إرفاق إيصال التحويل.

# transfer_exact_amount_note
source: Please transfer the exact amount without any excess or shortage for faster processing.
ar: يرجى تحويل المبلغ بالضبط بدون زيادة أو نقص لسرعة اضافة الاموال.

source: Contact Ad
ar: إعلان اتصال

# contact_note
source: This goal is used for contact ads
ar: هذا الهدف يستخدم لإعلانات الاتصال

source: Smart
ar: سمارت

# price
source: Set Price
ar: محدد بسعر

# smart_note
source: Notes: The call price is determined by daily competition, remains the first ad, and is approved quickly.
ar: ملاحظات يحدد سعر الاتصال حسب المنافسة باليوم ويظل الاعلان الاول وتتم الموافقة عليه بسرعة

# price_note
source: The price per call is determined and reviewed by Google within 48 hours.
ar: يتم تحديد سعر الاتصال الواحد يتم المراجعة من جوجل خلال 48 ساعة

# set_price
source: Set Call Price
ar: تحديد سعر الاتصال

# select_ad_type
source: Please select ad type
ar: برجاء اختيار نوع الحملة

source: Select location
ar: اختر الموقع

source: Select post
ar: اختر المنشور

# ad_post_saved
source: Post saved
ar: تم حفظ المنشور

source: Run ad
ar: تشغيل الإعلان

# enter_phone
source: Please enter your phone number with country code
ar: برجاء تحديد رقم الهاتف بكود الدولة

source: Saved phone
ar: الهاتف المحفوظ

source: Select Ad Goal
ar: اختر هدف الإعلان

source: Exclude Area
ar: استبعاد مناطق

# enter_exclude_area
source: Enter the area to exclude
ar: أدخل المنطقة المراد استبعادها

source: Excluded Areas
ar: المناطق المستبعدة

# funds_will_be_added
source: Your request has been submitted for review, and funds will be added within two working hours. Please check your balance.
ar: تم ارسال طلبكم للمراجعة وسيتم اضافة الاموال خلال ساعتين عمل برجاء متابعة الرصيد

# funds_request_in_progress
source: Your request to add funds is in progress.
ar: طلبكم بإضافة الأموال قيد التنفيذ

source: AM
ar: ص

source: PM
ar: م

source: Activate Ad
ar: تشغيل الإعلان

# activate_ad_request_sent
source: A request has been sent to the admin to reactivate the ad with the remaining budget
ar: تم إرسال طلب للإدارة لإعادة تشغيل الإعلان بالميزانية المتبقية

# refund_policy
source: You can only refund the money that was charged without coupons
ar: يمكنك استرجاع الاموال التي تم شحنها فقط بدون كوبونات

# refund_request_submitted
source: Your refund request has been submitted
ar: تم تقديم طلب استرجاع الاموال

# phone_already_registered
source: This phone number is already registered
ar: رقم الهاتف هذا مسجل بالفعل

# faq_question_9
source: What are the working hours and what is the company's address and location?
ar: ما هي مواعيد العمل وما هو عنوان الشركة واللوكشن؟

# faq_answer_9
source: Official working hours From 10:00 AM to 2:00 AM after midnight Company address Building 7 (Beam), Rukn El Safa, from Khaled Amin, from El Ahram Street, Giza, 9th floor - in front of the elevator Location [Click here](https://goo.gl/maps/hPNEgJBsGTVYFf7g8)
ar: مواعيد العمل الرسمية من الساعة 10:00 ص حتى الساعة 2:00 ص بعد منتصف الليل عنوان الشركة 7 عمارة (بيم) ركن الصفا من خالد أمين من شارع العريش الهرم الجيزة الدور التاسع - أمام الأسانسير اللوكشن [اضغط هنا](https://goo.gl/maps/hPNEgJBsGTVYFf7g8)

source: WhatsApp Number
ar: رقم الواتس آب

source: Saved WhatsApp Number
ar: رقم الواتس آب المحفوظ

source: Copy Confirmation
ar: تأكيد النسخ

# email_copied
source: Email address copied to clipboard:
ar: تم نسخ عنوان البريد الإلكتروني إلى الحافظة:

source: Official Email
ar: البريد الإلكتروني الرسمي

source: Database Email
ar: البريد الإلكتروني من قاعدة البيانات

source: Post Link
ar: رابط المنشور

source: Page Link
ar: رابط الصفحة

source: Ad Code
ar: كود الإعلان

source: Selected Option
ar: الخيار المحدد

source: Selected Platform
ar: المنصة المختارة

source: Image URLs
ar: روابط الصور

source: Image Names
ar: أسماء الصور

source: Post Content
ar: محتوى المنشور

source: Upload Status
ar: حالة الرفع

source: Remove Image
ar: إزالة الصورة

source: Video Link
ar: رابط الفيديو

source: Create New Post
ar: إنشاء منشور جديد

# instagramAdInfo
source: If you choose an Instagram ad, the post must be linked to a Facebook page to create the ad.
ar: في حالة اختيار اعلان انستجرام لابد من ان يكون المنشور مربوط بصفحة فيس بوك لانشاء الاعلان

# facebookAndInstagramAdInfo
source: If you choose a Facebook and Instagram ad, make sure the Facebook page is linked to Instagram. If there is no link between Facebook and Instagram, the ad will only be created on Facebook.
ar: في حالة انك اختارت اعلان فيس بوك وانستجرام يجب التاكد ان صفحة الفيس بوك مربوطة بالانستجرام في حالة انه لا يوجد ربط بين الفيس بوك والانستجرام سيتم انشاء الاعلان علي الفيس بوك فقط

# tiktokAdInfo
source: If you choose a TikTok ad, you must enter the ad code.
ar: في حالة اختيار اعلان التيك توك يجب وضع كود الاعلان

source: Current Ad Code
ar: كود الإعلان الحالي

# adCodeInfo
source: How to get the ad code
ar: طريقة الحصول على كود الإعلان

source: Link copied
ar: تم نسخ الرابط

source: Current page link
ar: رابط الصفحة الحالي

# enterPostContent
source: Enter post content here...
ar: اكتب محتوى المنشور هنا...

# selectImages
source: Select post images (you can choose one or more images up to 10 images)
ar: حدد صور المنشور (يمكنك اختيار صورة أو أكثر حتى 10 صور)

# facebookAndInstagram
source: Facebook & Instagram
ar: فيس بوك & انستجرام

# update_available_title
source: Update Available
ar: تحديث جديد متاح

# update_available_message
source: A new version of the app is available. Please update it now.
ar: يوجد إصدار جديد من التطبيق. من فضلك قم بتحديثه الآن.

source: Later
ar: لاحقا

# update_button
source: Update
ar: تحديث

# later_button
source: Later
ar: لاحقا

# faq_question_10
source: How to promote someone to admin or editor?
ar: كيف أرفع شخص إلى مسؤول أو محرر؟

# faq_question_11
source: How to get the TikTok ad code?
ar: كيف أحصل على كود الإعلان لتيك توك؟

# faq_question_12
source: Is there a video tutorial available?
ar: هل يتوافر شرح بالفيديوهات؟

source: total
ar: الاجمالي

# administration_0_percent
source: administration
ar: الادارة

# administration_15_percent
source: administration
ar: الادارة

source: details
ar: تفاصيل

source: Previous Requests
ar: الطلبات السابقة

source: professional video
ar: فيديو احترافي

source: video creation
ar: انشاء فيديو
