Repository: radyemam/Bird-ads.com
Catalog: lib/l10n/intl_*.arb
Languages: ar

# title
source: Settings
ar: تغيير اللغة

# choose_language
source: Please choose a language
ar: من فضلك اختر اللغة

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Save
ar: حفظ

# language_saved
source: Language saved successfully
ar: تم حفظ التغيير بنجاح

# account_balance_wallet
source: My Accounts
ar: حساباتي

source: Edit Profile
ar: تعديل الملف الشخصي

source: FAQ
ar: الأسئلة المتداولة

source: Support
ar: الدعم

source: Change Language
ar: تغيير اللغة

source: Logout
ar: تسجيل الخروج

source: Settings
ar: الإعدادات

# uid_copied
source: UID copied to clipboard
ar: تم نسخ UID إلى الحافظة

# logout_confirmation
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Wallet Balance
ar: رصيد المحفظة

source: Refund Request
ar: طلب مرتجع

source: Add Coupon
ar: اضافة كوبون

source: Add Balance
ar: اضافة رصيد

source: Detailed Account Statement
ar: كشف حساب مفصل

source: Create Ad with Experts
ar: إنشاء إعلان بواسطة الخبراء

source: Enter Ad Name
ar: إدخال اسم الإعلان

# ad_name_placeholder
source: Type the ad name here
ar: اكتب اسم الإعلان هنا

source: Select Platform
ar: اختر المنصة

source: Ad Goal
ar: الهدف من الإعلان

source: Target Audience
ar: الفئات المستهدفة

source: Gender and Age
ar: النوع والعمر

source: Location Selection
ar: اختيار الموقع

source: Duration and Budget
ar: المدة والميزانية

source: Post Content
ar: محتوى المنشور

source: Permissions
ar: الصلاحيات

source: Submit Ad
ar: تشغيل الإعلان

# ad_sent_success
source: Ad has been submitted and will be processed within 2 working hours. Please check notifications.
ar: تم إرسال الإعلان وسيتم تنفيذه خلال ساعتين عمل. برجاء متابعة الإشعارات.

source: OK
ar: موافق

source: Website Link
ar: رابط الموقع

source: App Link
ar: رابط التطبيق

source: Details Form
ar: استمارة التفاصيل

# budget_days_error
source: Please specify the budget and number of days
ar: برجاء تحديد الميزانية وعدد الأيام

# post_selection_error
source: Please specify the post selection
ar: برجاء تحديد اختيار المنشور

# choose_ad_platform
source: Choose your ad platform
ar: اختر منصة اعلانك

source: Facebook
ar: فيس بوك

source: Instagram
ar: انستجرام

source: Facebook & Instagram
ar: فيس بوك & انستجرام

source: TikTok
ar: تيك توك

source: Google
ar: جوجل

source: YouTube
ar: يوتيوب

source: Create ad with company experts
ar: انشاء اعلان بواسطة الخبراء من ادارة الشركة

source: Please choose
ar: برجاء الاختيار

# choose_one_of_the_following
source: Choose one of the following options:
ar: اختر أحد الخيارات التالية:

# continue_previous_ad
source: Continue your previous ad
ar: استكمل إعلانك السابق

# choose_ad_platform_title
source: Choose Ad Platform
ar: اختر المنصة الاعلانية

# start_new_ad
source: Start a new ad
ar: ابدأ إعلان من جديد

# choose_ad_goal_title
source: Choose Ad Goal
ar: اختر هدف الاعلان

# choose_ad_goal
source: Choose your ad goal
ar: اختر هدف إعلانك

source: Messenger Messages
ar: رسايل ماسنجر

source: WhatsApp Messages
ar: رسايل واتس اب

source: Instagram Direct Messages
ar: رسايل انستجرام دايركت

source: Post Engagement
ar: تفاعل علي المنشور

source: Increase Followers
ar: زيادة متابعين

source: Website Visits
ar: زيارات علي موقع ويب

source: Instant Forms
ar: نماذج فوري

source: App Downloads
ar: تحميل تطبيق

# messenger_note
source: (best and cheapest)
ar: (الافضل والارخص)

# whatsapp_note
source: (make sure the page is linked to WhatsApp)
ar: (يرجي التاكد من ان الصفحة مربوطة بالواتس اب)

# instagram_note
source: (for Instagram campaigns only)
ar: (في حملات الانستجرام فقط)

# post_engagement_note
source: (to increase likes and comments on the post)
ar: (لزيادة اللايكات والتعليقات علي المنشور)

# increase_followers_note
source: (to increase page followers)
ar: (لتزويد متابعين الصفحة)

# website_note
source: (please provide the website link)
ar: (يرجي وضع اسم الموقع)

# instant_forms_note
source: (more expensive - lead generation)
ar: (lead generation الاغلي سعرا)

# app_downloads_note
source: (Android or iPhone)
ar: (اندرويد او ايفون)

source: Instant Form Details
ar: تفاصيل النموذج الفوري

source: Saved link:
ar: الرابط المحفوظ:

source: Saved app link:
ar: رابط التطبيق المحفوظ:

source: Saved instant form details:
ar: تفاصيل النموذج المحفوظ:

source: From
ar: من

source: To
ar: إلى

source: Men
ar: رجال

source: Women
ar: سيدات

source: Men and Women
ar: رجال وسيدات

source: Choose Gender
ar: اختر النوع

source: Choose Age
ar: اختر العمر

source: Keywords and Titles
ar: الكلمات البحثية والعناوين

# enter_keywords_and_titles
source: Please enter the keywords and titles you prefer:
ar: برجاء كتابة الكلمات البحيثة والعناوين التي تفضلها:

# location_selection_page_title
source: Select Locations for Your Ad
ar: اختر مواقع استهداف اعلانك

# select_countries
source: Select Locations
ar: اختر المواقع

# select_country_hint
source: Select Country
ar: اختار الدولة

# select_region_hint
source: Select State/City
ar: اختار المحافظة/المدينة

# selected_locations_title
source: Selected Countries and Regions
ar: الدول والمحافظات المختارة

source: Clear All
ar: مسح الكل

source: Egypt
ar: مصر

source: Saudi Arabia
ar: السعودية

source: Kuwait
ar: الكويت

source: UAE
ar: الامارات

source: Qatar
ar: قطر

source: Bahrain
ar: البحرين

source: Oman
ar: سلطنة عمان

source: USA
ar: امريكا

source: Canada
ar: كندا

source: Libya
ar: ليبيا

source: Algeria
ar: الجزائر

source: Morocco
ar: المغرب

# egypt_all
source: All Egypt
ar: مصر كلها

source: Cairo
ar: القاهرة

source: Giza
ar: الجيزة

source: Alexandria
ar: الإسكندرية

source: Luxor
ar: الأقصر

source: Aswan
ar: أسوان

source: Faiyum
ar: الفيوم

source: Gharbia
ar: الغربية

source: Sharqia
ar: الشرقية

source: Dakahlia
ar: الدقهلية

source: Qalyubia
ar: القليوبية

source: Monufia
ar: المنوفية

source: Kafr El Sheikh
ar: كفر الشيخ

source: Beheira
ar: البحيرة

source: Matruh
ar: مطروح

source: North Sinai
ar: شمال سيناء

source: South Sinai
ar: جنوب سيناء

source: Red Sea
ar: البحر الأحمر

source: Suez
ar: السويس

source: Port Said
ar: بورسعيد

source: Ismailia
ar: الإسماعيلية

source: Minya
ar: المنيا

source: Asyut
ar: أسيوط

source: Sohag
ar: سوهاج

source: Qena
ar: قنا

source: Bani Suef
ar: بني سويف

source: New Valley
ar: الوادي الجديد

source: Damietta
ar: دمياط

# saudi_all
source: All Saudi Arabia
ar: السعودية كلها

source: Riyadh
ar: الرياض

source: Jeddah
ar: جدة

source: Mecca
ar: مكة

source: Medina
ar: المدينة

source: Dammam
ar: الدمام

source: Khobar
ar: الخبر

source: Taif
ar: الطائف

source: Buraidah
ar: بريدة

source: Abha
ar: أبها

source: Khamis Mushait
ar: خميس مشيط

source: Hail
ar: حائل

source: Arar
ar: عرعر

source: Jazan
ar: جازان

source: Najran
ar: نجران

source: Tabuk
ar: تبوك

source: Al Bahah
ar: الباحة

source: Sakaka
ar: سكاكا

source: Dhahran
ar: الظهران

# kuwait_all
source: All Kuwait
ar: الكويت كلها

source: Capital
ar: العاصمة

source: Farwaniya
ar: الفروانية

source: Jahra
ar: الجهراء

source: Hawalli
ar: حولي

source: Ahmadi
ar: الأحمدي

source: Mubarak Al Kabeer
ar: مبارك الكبير

# uae_all
source: All UAE
ar: الامارات كلها

source: Abu Dhabi
ar: أبو ظبي

source: Dubai
ar: دبي

source: Sharjah
ar: الشارقة

source: Ajman
ar: عجمان

source: Ras Al Khaimah
ar: رأس الخيمة

source: Fujairah
ar: الفجيرة

source: Umm Al Quwain
ar: أم القيوين

# qatar_all
source: All Qatar
ar: قطر كلها

source: Doha
ar: الدوحة

source: Rayyan
ar: الريان

source: Wakra
ar: الوكرة

source: Khor
ar: الخور

source: Shamal
ar: الشمال

source: Um Said
ar: أم صلال

source: Shayhaniya
ar: الشيحانية

# bahrain_all
source: All Bahrain
ar: البحرين كلها

source: Manama
ar: المنامة

source: Muharraq
ar: المحرق

source: Riffa
ar: الرفاع

source: Isa Town
ar: عيسى

source: Hamad Town
ar: حمد

source: Jidhafs
ar: جدحفص

source: Sitra
ar: سترة

source: Budiya
ar: البديع

# oman_all
source: All Oman
ar: سلطنة عمان كلها

source: Muscat
ar: مسقط

source: Salalah
ar: صلالة

source: Sohar
ar: صحار

source: Nizwa
ar: نزوى

source: Rustaq
ar: الرستاق

source: Ibri
ar: عبري

source: Buraimi
ar: البريمي

source: Sur
ar: صور

source: Khasab
ar: خصب

# usa_all
source: All USA
ar: امريكا كلها

source: New York
ar: نيويورك

source: Los Angeles
ar: لوس أنجلوس

source: Chicago
ar: شيكاغو

source: Houston
ar: هيوستن

source: Phoenix
ar: فينيكس

source: Philadelphia
ar: فيلادلفيا

source: San Antonio
ar: سان أنطونيو

source: San Diego
ar: سان دييغو

source: Dallas
ar: دالاس

source: San Jose
ar: سان خوسيه

# canada_all
source: All Canada
ar: كندا كلها

source: Toronto
ar: تورنتو

source: Vancouver
ar: فانكوفر

source: Montreal
ar: مونتريال

source: Calgary
ar: كالجاري

source: Ottawa
ar: أوتاوا

source: Edmonton
ar: إدمونتون

source: Winnipeg
ar: وينيبيغ

source: Quebec
ar: كيبك

source: Halifax
ar: هاليفاكس

source: Victoria
ar: فيكتوريا

# libya_all
source: All Libya
ar: ليبيا كلها

source: Tripoli
ar: طرابلس

source: Benghazi
ar: بنغازي

source: Misrata
ar: مصراتة

source: Zawiya
ar: الزاوية

source: Beida
ar: البيضاء

source: Sebha
ar: سبها

source: Sert
ar: سرت

source: Tobruk
ar: طبرق

source: Ajdabiya
ar: اجدابيا

source: Gharyan
ar: غريان

# algeria_all
source: All Algeria
ar: الجزائر كلها

source: Algiers
ar: الجزائر

source: Oran
ar: وهران

source: Constantine
ar: قسنطينة

source: Annaba
ar: عنابة

source: Blida
ar: البليدة

source: Batna
ar: باتنة

source: Sidi Bel Abbes
ar: سيدي بلعباس

source: Bejaia
ar: بجاية

source: Tiaret
ar: تيارت

source: Tlemcen
ar: تلمسان

# morocco_all
source: All Morocco
ar: المغرب كلها

source: Rabat
ar: الرباط

source: Casablanca
ar: الدار البيضاء

source: Marrakesh
ar: مراكش

source: Fes
ar: فاس

source: Tangier
ar: طنجة

source: Agadir
ar: أغادير

source: Oujda
ar: وجدة

source: Kenitra
ar: القنيطرة

source: Tetouan
ar: تطوان

source: Safi
ar: آسفي

# posts_page_title
source: Posts
ar: المنشورات

source: Current post link:
ar: رابط المنشور الحالي:

source: Current site link:
ar: رابط الموقع الحالي:

source: Current video link:
ar: رابط الفيديو الحالي:

source: Current ad code:
ar: كود الاعلان الحالي:

# hint_post_content
source: Content
ar: المحتوي

source: Clear
ar: مسح

source: Uploading files...
ar: جاري رفع الملفات...

source: Files uploaded
ar: تم رفع الملفات

# select_post_images
source: Select post images (You can choose one or more up to 10 images)
ar: حدد صور المنشور (يمكنك اختيار صورة أو أكثر حتى 10 صور)

source: Error: user is null
ar: خطأ: المستخدم غير موجود

# error_current_ad_id_not_found
source: Error: currentAdId not found in user document
ar: خطأ: currentAdId غير موجود في مستند المستخدم

# hint_keywords_and_titles
source: Type the keywords and titles here...
ar: اكتب الكلمات البحيثة والعناوين هنا...

source: Click to edit keywords and titles
ar: اضغط لتحرير الكلمات البحثية والعناوين

# empty_page
source: Empty page currently
ar: صفحة فارغة حالياً

source: Create new post
ar: إنشاء منشور جديد

# permissions_page_title
source: Permissions
ar: الصلاحيات

# assign_account_admin
source: Please assign the company account as an admin or editor to be able to create the ad
ar: برجاء تعيين اكونت الشركة كمسؤول او محرر حتي نستطيع انشاء الاعلان

source: How to assign admin
ar: طريقة رفع الادمن

source: Account link:
ar: رابط الاكونت:

source: Account name:
ar: اسم الاكونت:

# account_logo
source: Account picture: Company logo
ar: صورة الاكونت: لوجو الشركة

# option_admin_or_editor
source: I have already assigned as admin or editor
ar: رفعت أدمن او محرر بالفعل

# option_sent_friend_request
source: I couldn't see the account and sent a friend request
ar: لم استطع أن أرى الحساب وأرسلت طلب صداقة

# note_how_to_assign_admin
source: Note: If you couldn't assign the admin, please see the admin assignment method
ar: ملاحظة: لو لم تستطيع رفع الادمن برجاء النظر الي طريقة رفع الادمن

# cannot_create_ad
source: If the admin or editor is not assigned, we will not be able to create the ad
ar: إذا لم يتم رفع أدمن او محرر لن نستطيع انشاء الاعلان

# copied_text
source: {text} copied
ar: تم نسخ {text}

# confirm_admin_or_friend_request
source: Please confirm assigning the admin or sending a friend request
ar: يرجى تأكيد رفع الأدمن أو إرسال طلب صداقة

source: Search Behavior
ar: ابحث عن السلوك

# search_behavior_hint
source: Search for behavior
ar: ابحث عن السلوك

# save_behaviors
source: Save
ar: حفظ

source: Selected Behaviors
ar: السلوكيات المحددة

source: All Behaviors
ar: كل السلوكيات

source: Engaged Shoppers
ar: المتسوقون المتفاعلون

# soccer_fans_moderate
source: Soccer Fans (Moderate Content)
ar: مشجعي كرة القدم (المحتوى المعتدل)

# soccer_fans_high
source: Soccer Fans (High Content)
ar: مشجعي كرة القدم (المحتوى العالي)

source: Friends of Soccer Fans
ar: أصدقاء محبي كرة القدم

# facebook_access_mobile_all_devices
source: Facebook Access (Mobile): All Mobile Devices
ar: الوصول إلى فيسبوك (موبايل): جميع الأجهزة المحمولة

# facebook_access_mobile_smartphones_tablets
source: Facebook Access (Mobile): Smartphones and Tablets
ar: الوصول إلى فيسبوك (موبايل): الهواتف الذكية والأجهزة اللوحية

source: Facebook Access (Mobile): Feature Phones
ar: الوصول إلى فيسبوك (موبايل): هواتف بميزات أساسية

source: All Mobile Devices by Brand
ar: جميع الأجهزة المحمولة حسب العلامة التجارية

source: All Mobile Devices by OS
ar: جميع الأجهزة المحمولة حسب نظام التشغيل

# new_smartphone_tablet_users
source: New Smartphone and Tablet Users
ar: مستخدمي الهواتف الذكية والأجهزة اللوحية الجدد

source: Network Connection
ar: اتصال الشبكة

source: Android: 360 Media Supported
ar: أندرويد: الوسائط المدعومة 360 درجة

source: Android: 360 Media Not Supported
ar: أندرويد: الوسائط غير المدعومة 360 درجة

source: Owns: OnePlus
ar: يملك: OnePlus

source: Small Business Owners
ar: أصحاب الأعمال الصغيرة

source: Facebook Payment Users (90 Days)
ar: مستخدمو مدفوعات فيسبوك (90 يومًا)

source: Technology Early Adopters
ar: المتبنين المبكرين للتكنولوجيا

source: OS Used
ar: نظام التشغيل المستخدم

# facebook_access_old_devices_os
source: Facebook Access: Old Devices and OS
ar: الوصول إلى فيسبوك: الأجهزة ونظام التشغيل القديمة

source: Facebook Payment Users (30 Days)
ar: مستخدمو مدفوعات فيسبوك (30 يومًا)

source: Mobile Gamers
ar: لاعبي الأجهزة المحمولة

source: Browser Used
ar: المتصفح المستخدم

source: Facebook Page Admins
ar: مدراء صفحة فيسبوك

source: Canvas Games
ar: ألعاب الكانفاس

# people_visited_facebook_gaming
source: People Who Visited Facebook Gaming
ar: الأشخاص الذين قاموا بزيارة Facebook Gaming

source: New Active Business (> 6 Months)
ar: عمل نشط جديد (> 6 أشهر)

source: New Active Business (> 24 Months)
ar: عمل نشط جديد (> 24 شهرًا)

source: New Active Business (> 12 Months)
ar: عمل نشط جديد (> 12 شهرًا)

source: Instagram Business Profile Admins
ar: مسؤولو الملف الشخصي لأعمال Instagram

source: Frequent Travelers
ar: المسافرون بشكل متكرر

# returned_from_travel_week
source: Returned from Travel (1 Week)
ar: عادوا من السفر منذ أسبوع

# returned_from_travel_two_weeks
source: Returned from Travel (2 Weeks)
ar: عادوا من السفر منذ أسبوعين

source: Daily Commuters
ar: المسافرون يوميًا

source: Frequent International Travelers
ar: المسافرون الدوليين بشكل متكرر

source: Facebook Lite Users
ar: مستخدمو تطبيق Facebook Lite

source: Store Admins
ar: مسؤولو المتاجر

# travel_outdoor_enthusiasts
source: Travel and Outdoor Enthusiasts
ar: مبدعو السفر والأنشطة الخارجية

# food_drink_creators
source: Food and Drink Creators
ar: مبدعو الطعام والشراب

# health_wellness_creators
source: Health and Wellness Creators
ar: مبدعو الصحة والعافية

source: All Creators
ar: جميع المبدعين

source: Internet Personality Creators
ar: مبدعو شخصيات الإنترنت

source: Travel
ar: السفر

source: Digital Activities
ar: الأنشطة الرقمية

source: Mobile Device User
ar: مستخدم الجهاز المحمول

source: Expats
ar: المغتربين

source: Anniversary
ar: ذكرى

source: Consumer Classification
ar: تصنيف المستهلك

source: Purchase Behavior
ar: سلوك الشراء

source: Soccer
ar: كرة القدم

source: More Categories
ar: المزيد من الفئات

source: Mobile Device User / Device Usage Time
ar: مستخدم الجهاز المحمول / وقت استخدام الجهاز

source: Behaviors
ar: السلوكيات

source: Digital Activities Team
ar: فريق الأنشطة الرقمية

# demographic_status_page_title
source: Demographic Status
ar: الحالة الديموجرافية

# search_demographic_status
source: Search for demographic status
ar: ابحث عن الحالة الديموجرافية

# status_1
source: Parents (up to 12 months)
ar: والدان (حتى 12 شهرًا)

# status_2
source: Parents with infants (1 to 2 years)
ar: الوالدان اللذان لديهم أطفال رضّع (من عام إلى عامين)

# status_3
source: Parents with preschoolers (3 to 5 years)
ar: والدان لديهما أطفال في مرحلة ما قبل المدرسة (من 3 إلى 5 سنوات)

# status_4
source: Parents with young school-age children (6 to 8 years)
ar: الوالدان الذين لديهم أطفال في المراحل الدراسية المبكرة (من 6 إلى 8 أعوام)

# status_5
source: Parents with teenagers (13 to 17 years)
ar: الوالدان الذين لديهم أطفال في سن المراهقة (من 13 إلى 17 عامًا)

# status_6
source: Parents with adult children (18 to 26 years)
ar: الوالدان اللذان لديهم أطفال كبار (من 18 إلى 26 عامًا)

# status_7
source: Parents with preteens (9 to 12 years)
ar: الوالدان اللذان لديهم أطفال في مرحلة ما قبل سن المراهقة (من 09 إلى 12 عامًا)

# status_8
source: Veterans (US)
ar: المحاربون القدامى (الولايات المتحدة)

# status_9
source: Government employees (global)
ar: موظفون حكوميون (عالمي)

# status_10
source: Employees of large businesses dealing with other businesses (500+ employees)
ar: موظفو الأنشطة التجارية الكبيرة التي تدير أعمالها مع أنشطة تجارية أخرى (500 موظف فأكثر)

# status_11
source: Employees of medium-sized businesses dealing with other businesses (200 to 500 employees)
ar: موظفو الأنشطة التجارية المتوسطة التي تدير أعمالها مع أنشطة تجارية أخرى (200 إلى 500 موظف)

# status_12
source: Employees of small businesses dealing with other businesses (10 to 200 employees)
ar: موظفو الأنشطة التجارية الصغيرة التي تدير أعمالها مع أنشطة تجارية أخرى (10 إلى 200 موظف)

# status_13
source: Job titles and interests of business decision-makers
ar: المسميات الوظيفية والاهتمامات لصانعي قرارات الأعمال

# status_14
source: Business decision-makers
ar: صانعو قرارات الأعمال

# status_15
source: IT decision-makers
ar: صانعو القرار في تكنولوجيا المعلومات

# status_16
source: Company size: 11-100 employees
ar: حجم الشركة: 11-100 موظف

# status_17
source: Companies founded before 2000
ar: الشركات التي تأسست قبل 2000

# status_18
source: Companies founded between 2010 and now
ar: الشركات التي تأسست بين عام 2010 وحتى الآن

# status_19
source: Company revenue from 1 million to 10 million
ar: إيرادات الشركة من 1 مليون إلى 10 مليون

# status_20
source: Company revenue less than 1 million
ar: إيرادات الشركة أقل من 1 مليون

# status_21
source: Company size 101-150 employees
ar: حجم الشركة 10150 موظف

# status_22
source: Company size 1-10 employees
ar: حجم الشركة 110 موظف

# status_23
source: Companies founded between 2000 and 2009
ar: الشركات التي تأسست بين عامي 2000 و 2009

# status_24
source: Company revenue more than 10 million
ar: إيرادات الشركة أكثر من 10 مليون

# status_25
source: Company size more than 500 employees
ar: حجم الشركة أكثر من 500 موظف

# status_26
source: Transportation and mobility
ar: النقل والتنقل

# status_27
source: Friends of people who recently moved
ar: أصدقاء الأشخاص الذين غيروا محل إقامتهم مؤخراً

# status_28
source: Friends of people with birthdays within a month
ar: أصدقاء الأشخاص عيد ميلادهم خلال شهر

# status_29
source: Friends of women with birthdays within 7 to 30 days
ar: أصدقاء لنساء عيد ميلادهن خلال 7 أيام إلى 30 يوماً

# status_30
source: Friends of men with birthdays within 7 to 30 days
ar: أصدقاء لرجال عيد ميلادهم خلال 7 أيام إلى 30 يوماً

# status_31
source: Friends of people with birthdays within a week
ar: أصدقاء الأشخاص عيد ميلادهم خلال أسبوع

# status_32
source: Friends of women with birthdays within 0 to 7 days
ar: أصدقاء لنساء عيد ميلادهن خلال 0 إلى 7 أيام

# status_33
source: Friends of men with birthdays within 0 to 7 days
ar: أصدقاء لرجال عيد ميلادهم خلال 0 إلى 7 أيام

# status_34
source: Away from family
ar: بعيداً عن العائلة

# status_35
source: Away from place of origin
ar: البعيدون عن مكان المنشأ

# status_36
source: Long-distance relationship
ar: علاقة عن بُعد

# status_37
source: People who recently moved
ar: الأشخاص الذين غيروا محل إقامتهم مؤخراً

# status_38
source: New job
ar: وظيفة جديدة

# status_39
source: New relationship
ar: علاقة جديدة

# status_40
source: Recently engaged (3 months)
ar: مخطوب/مخطوبة حديثاً (3 أشهر)

# status_41
source: Recently married (3 months)
ar: متزوج حديثاً (3 أشهر)

# status_42
source: Life, physical, and social sciences
ar: علوم الحياة والعلوم الفيزيائية والاجتماعية

# status_43
source: Computing and mathematics
ar: حوسبة ورياضيات

# status_44
source: Community and social services
ar: المجتمع والخدمات الاجتماعية

# status_45
source: Protective services
ar: خدمات وقائية

# status_46
source: Agriculture, fishing, and forestry
ar: الزراعة والصيد وعلم الغابات

# status_47
source: Cleaning and maintenance services
ar: خدمات تنظيف وصيانة

# status_48
source: Military (global)
ar: عسكري (عالمي)

# status_49
source: Administrative services
ar: خدمات إدارية

# status_50
source: Technical and IT services
ar: خدمات فنية وتكنولوجيا معلومات

# status_51
source: Legal services
ar: خدمات قانونية

# status_52
source: Sales
ar: مبيعات

# status_53
source: Education and libraries
ar: تعليم ومكتبات

# status_54
source: Business and finance
ar: أعمال وماليات

# status_55
source: Recently married (1 year)
ar: متزوج حديثا (سنة واحدة)

# status_56
source: Recently engaged (6 months)
ar: الاشخاص المخطبون حديثا (6 اشهر)

# status_57
source: Recently married (6 months)
ar: متزوج حديثا (6 اشهر)

# status_58
source: Recently engaged (1 year)
ar: الاشخاص المخطبون حديثا (سنة واحدة)

# status_59
source: Management
ar: إدارة

# status_60
source: Arts, entertainment, sports, and media
ar: فنون وترفيه ورياضات وإعلام

source: Ad Targeting
ar: استهداف الإعلان

source: Ad Targets
ar: استهدافات الاعلان

source: Leave blank to add expert categories
ar: اتركه فارغًا وسيتم إضافة الفئات المستهدفة من خبراء الشركة

source: Interests
ar: الاهتمامات

# no_interests_selected
source: No interests selected yet
ar: لم يتم تحديد الاهتمامات حتى الآن

source: Demographic Status
ar: الحالة الديموجرافية

# no_demographic_status_selected
source: No demographic status selected yet
ar: لم يتم تحديد الحالة الديموجرافية حتى الآن

source: Behavior
ar: السلوك

# no_behavior_selected
source: No behavior selected yet
ar: لم يتم تحديد السلوك حتى الآن

source: Notes:
ar: ملاحظات:

# note1
source: 1- It is preferable that interests, behavior, and demographic status be from 5 to 7 selections total
ar: 1- يفضل ان يكون الاهتمامات والسلوك والحالة الديموجرافية من 5 الي 7 اختيارات كلهم

# note2
source: 2- If you do not know what to choose, leave it blank and it will be added by the experts in the administration
ar: 2- اذا لم تعرف ماذا تختار اتركه فارغا وسيتم الاضافة من الخبراء بالادارة

source: Soon
ar: قريباً

# feature_coming_soon
source: This feature will be available soon.
ar: هذه الميزة ستتوفر قريباً.

source: My Accounts
ar: حساباتي

# link_accounts
source: You can link your accounts to create professional ad campaigns
ar: يمكنك ربط حساباتك لتتمكن من عمل حملاتك الاعلانية بشكل احترافي

# cannot_link_instagram
source: You cannot link Instagram until you select a Facebook page with Instagram
ar: لن تتمكن من ربط حساب الانستغرام حتى تقوم باختيار صفحة فيسبوك عليها انستغرام

source: Connected
ar: متصل

source: Not Connected
ar: غير متصل

source: Unlink
ar: إلغاء الربط

source: Link Account
ar: ربط حسابك

source: Search Interests
ar: ابحث عن الاهتمامات

# enter_interests
source: Enter your interests here...
ar: أدخل اهتماماتك هنا...

source: Clothes
ar: ملابس

source: Belt (Clothes)
ar: حزام (ملابس)

# sports_swimwear
source: Sports Illustrated Swimwear Issue
ar: قضية ملابس السباحة الرياضية المصورة

source: Republic Clothing Remix
ar: ريمكس ملابس تائبية

source: Organic Clothing
ar: ملابس عضوية من الصورة

source: Work Clothes
ar: ملابس العمل
