Repository: radyemam/Bird-ads.com
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Fashion Picture
ar: ملابس الصورة

source: Castro (Clothes)
ar: كاسترو (ملابس)

source: Pinup Channel Clothes
ar: ملابس قناة Pinup

# charlotte_rousse_retailer
source: Charlotte Russe (Retailer)
ar: شارلوت روس (تاجر ملابس بالتجزئة)

source: Underwear
ar: ملابس داخلية

source: Hot Clothes
ar: ملابس ساخنة

source: Exclusive Clothes
ar: ملابس حصرية

source: Garage (Retailer)
ar: جراج (تاجر ملابس بالتجزئة)

source: Fila (Sportswear)
ar: فيلاد (شركة ملابس رياضية)

source: Strategy Games
ar: العاب استراتيجية

source: Property
ar: ملكية

source: Hotels
ar: الفنادق

source: Writing
ar: جاري الكتابة

source: Advertising
ar: دعاية

source: Loud Music
ar: موسيقى صاخبه

source: Anime Movies
ar: افلام انمي

source: Coffee
ar: قهوة

source: Heavy Metal Music
ar: موسيقى الهيفي ميتال

source: Hard Drives
ar: محركات الأقراص الصلبة

source: Card Games
ar: لعب الورق

source: Vegetarian
ar: نباتية

source: Bodybuilding
ar: كمال الاجسام

source: Economics
ar: اقتصاديات

source: Politics
ar: سياسة

source: Design
ar: تصميم

source: Cooking
ar: طبخ

source: Horror Movies
ar: أفلام رعب

source: Network Storage
ar: تخزين الشبكة

source: Law
ar: قانون

source: Puzzle Video Games
ar: ألعاب الفيديو اللغز

source: Pizza
ar: بيتزا

source: Sculpture
ar: النحت

source: Consumer Electronics
ar: مستهلكي الكترونيات

source: Juice
ar: عصير

source: Dancing
ar: الرقص

source: Free Software
ar: البرمجيات الحرة

source: Marathon
ar: ماراتون

source: Beaches
ar: الشواطئ

source: Tourism
ar: السياحة

source: Lakes
ar: بحيرات

source: Browser Games
ar: ألعاب المتصفح

source: Barbecue
ar: حفل شواء

source: Scouts
ar: سكوتز

source: Marriage
ar: زواج

source: Perfumes
ar: عطور

source: Hair Products
ar: منتجات الشعر

source: Books
ar: كتب

source: Pet Food
ar: طعام الحيوانات الاليفة

source: Online Banking
ar: الخدمات المصرفية عبر الإنترنت

source: Weight Training
ar: تدريب الوزن

source: DIY
ar: افعالها بنفسك (DIY)

source: Tea
ar: شاي

source: Family
ar: عائلة

source: Indian Cuisine
ar: مطبخ هندي

source: National Music
ar: موسيقى وطنية او قومية

source: Ice Skating
ar: التزلج على الجليد

source: Golf
ar: الجولف

source: Sports Games
ar: الألعاب الرياضية

source: Internet Ads
ar: اعلانات الانترنت

source: SEO
ar: محرك البحث الأمثل

source: Credit Cards
ar: بطاقات الائتمان

source: Entrepreneurship
ar: ريادة الأعمال

source: Fast Food Restaurants
ar: مطاعم الوجبات السريعة

source: Drama Movies
ar: أفلام درامية

source: Documentary Movies
ar: أفلام وثائقية

source: American Football
ar: كرة القدم الأمريكية

source: Role Playing Games
ar: ألعاب لعب الدور

source: Reptiles
ar: الزواحف

source: Portable Media Players
ar: مشغلات الوسائط المحمولة

source: Racing Games
ar: ألعاب سباق

# fitness_wellness
source: Fitness and Wellness
ar: اللياقة والعافية

source: Recipes
ar: وصفات

source: Website Hosting
ar: استضافة الموقع

source: Social Media Marketing
ar: تسويق وسائل الاعلام الاجتماعية

source: Investing
ar: استثمار

source: Energy Drinks
ar: مشروبات الطاقة

source: Shopping Centers
ar: مراكز التسوق

source: Drums
ar: طبول

source: Home Appliances
ar: الأجهزة المنزلية

source: Vietnamese Cuisine
ar: المطبخ الفيتنامي

source: Shoes
ar: أحذية

source: Online Shopping
ar: التسوق عبر الانترنت

source: Camping
ar: تخييم

source: Fashion Accessories
ar: اكسسوارات الموضة

source: Computer Memory
ar: ذاكرة الكمبيوتر

source: Entertainment
ar: وسائل الترفيه

source: Triathlon
ar: الترياتلون

source: Musical Theater
ar: مسرح موسيقي

source: Nature
ar: طبيعة سجية

source: Motorcycles
ar: دراجات نارية

source: Basketball
ar: كرة سلة

source: Nightclubs
ar: النوادي الليلية

source: Mobile Homes
ar: منازل متنقلة

source: Construction
ar: بناء

source: Tennis
ar: تنس

source: Casual Restaurants
ar: مطاعم غير رسمية سريعة

source: Management
ar: إدارة

source: Web Design
ar: تصميم المواقع

source: Business
ar: أعمال

source: Alcoholic Drink
ar: مشروب كحولي

source: Computers
ar: أجهزة الكمبيوتر

# children_clothes
source: Children's Clothes
ar: ملابس الأطفال

source: Weddings
ar: حفلات الزفاف

source: French Cuisine
ar: المطبخ الفرنسي

source: Plays
ar: يلعب

# charity_causes
source: Charity and Causes
ar: الصدقة والأسباب

source: Non-Fiction Books
ar: الكتب الواقعية

source: Action Games
ar: ألعاب الأكشن

source: Diners
ar: داينرز

source: Seafood
ar: مأكولات بحرية

source: Literature
ar: المؤلفات

source: Ballet
ar: باليه

source: Simulation Games
ar: ألعاب المحاكاة

source: Casino Games
ar: ألعاب الكازينو

source: Dancehall
ar: دانسهول

source: Sunglasses
ar: نظارة شمسية

source: Health Products
ar: منتجات صحية

source: Shopping
ar: التسوق

source: Fashion Design
ar: تصميم الأزياء

source: Jewelry
ar: مجوهرات

source: Blues Music
ar: موسيقى البلوز

source: Sports
ar: رياضات

source: Reality TV
ar: برامج تلفزيون الواقع

source: Higher Education
ar: تعليم عالي

source: Fiction Books
ar: كتب خيالية

source: GPS Devices
ar: أجهزة GPS

source: MMORPG
ar: ألعاب لعب الأدوار متعددة اللاعبين عبر الإنترنت

source: Middle Eastern Cuisine
ar: مطبخ شرق أوسطي

source: Handbags
ar: حقائب اليد

source: Sci-Fi Movies
ar: أفلام خيال علمي

source: Magazines
ar: المجلات

source: Romance Novels
ar: روايات رومانسية

source: People Carriers
ar: ناقلات الناس

source: Insurance
ar: تأمين

source: Discount Stores
ar: متاجر الخصم

source: Air Travel
ar: السفر جوا

source: Televisions
ar: التلفزيونات

source: Thriller Movies
ar: أفلام إثارة

source: Cruises
ar: الرحلات البحرية

source: Hip Hop Music
ar: موسيقى الهيب هوب

source: Parenting
ar: الأبوة والأمومة

source: Mountain Biking
ar: ركوب الدراجات في الجبل

source: Car Rentals
ar: تأجير السيارات

source: Trucks
ar: الشاحنات

source: Graphic Design
ar: تصميم جرافيك

source: Latin American Cuisine
ar: مطبخ أمريكا اللاتينية

source: Italian Cuisine
ar: المطبخ الإيطالي

source: Boutiques
ar: البوتيكات

source: Fishing
ar: الصيد

source: Crafts
ar: الحرف

source: Football
ar: كرة القدم

source: Soul Music
ar: موسيقى الروح

source: Spanish Cuisine
ar: المطعم الإسباني

source: Music Festivals
ar: مهرجانات موسيقية

source: Computer Monitors
ar: شاشات الكمبيوتر

source: Desktop Computers
ar: أجهزة الكمبيوتر المكتبية

source: Electric Car
ar: سيارة كهربائية

source: Cafes
ar: المقاهي

source: Boats
ar: القوارب

source: Candy
ar: حلوى

source: Beauty
ar: جمال

source: Science
ar: علوم

source: Cosmetics
ar: مستحضرات التجميل

source: Organic Food
ar: طعام عضوي

source: Adventure Trip
ar: رحلة مغامرة

source: Home Decor
ar: تصميم ديكور

source: Small Business
ar: أعمال صغيرة

source: Holidays
ar: العطل

source: Volleyball
ar: كرة الطائرة

source: Classical Music
ar: الموسيقى الكلاسيكية

source: Theater
ar: المسرح

source: Mexican Cuisine
ar: المطبخ المكسيكي

source: Aviation
ar: طيران

source: Parties
ar: حفلات

source: Mobile Phones
ar: الهواتف المحمولة

source: Surfing
ar: تصفح

source: Mystery Fiction
ar: خيال غامض

source: Outdoor Recreation
ar: الاستجمام في الهواء الطلق

source: Motherhood
ar: أمومة

source: Singing
ar: الغناء

source: Reading
ar: قراءة

source: Video Cameras
ar: كاميرات الفيديو

source: Music
ar: موسيقى

source: Gambling
ar: القمار

source: Japanese Cuisine
ar: المطبخ الياباني

source: Online Poker
ar: البوكير عبر الإنترنت

# arts_music
source: Arts and Music
ar: الفن والموسيقى

source: Tattoos
ar: الأوشام

source: Coupons
ar: الكوبونات

source: Gardens
ar: الحدائق

source: Community Issues
ar: قضايا المجتمع

source: Ecotourism
ar: السياحة البيئية

source: First Person Shooters
ar: ألعاب إطلاق النار من منظور شخص أول

source: Retail Banking
ar: الخدمات المصرفية للأفراد

source: Investment Banking
ar: الخدمات المصرفية الاستثمارية

source: Mountains
ar: الجبال

# children_games
source: Children's Games
ar: ألعاب الأطفال

source: Sales
ar: مبيعات

source: Ebooks
ar: كتب إلكترونية

source: Manga
ar: مانجا

source: Email Marketing
ar: التسويق عبر البريد الإلكتروني

source: Beauty Salons
ar: صالونات التجميل

source: Baseball
ar: البيسبول

source: Thai Cuisine
ar: المطبخ التايلاندي

source: Smartphones
ar: الهواتف الذكية

source: Projectors
ar: أجهزة عرض

source: Web Development
ar: تطوير الشبكة

source: Current Events
ar: الأحداث الحالية

source: Drinks
ar: مشروبات

source: Greek Cuisine
ar: المطبخ اليوناني

source: Yoga
ar: يوغا

source: Cameras
ar: الكاميرات

source: Skiing
ar: التزلج

source: Dogs
ar: الكلاب

source: Pop Music
ar: موسيقى البوب

source: Music Videos
ar: أشرطة الفيديو والموسيقى

source: Korean Cuisine
ar: المطبخ الكوري

source: Digital Marketing
ar: التسويق الرقمي

source: TV Game Shows
ar: برامج الألعاب التلفزيونية

source: Furniture
ar: أثاث

source: Animated Movies
ar: أفلام الرسوم المتحركة

source: Vehicles
ar: مركبات

source: Volunteering
ar: التطوع

source: Mortgage Loans
ar: قروض الرهن العقاري

source: Computer Processors
ar: معالجات الكمبيوتر

source: Personal Finance
ar: تمويل شخصي

source: Car Racing
ar: سباق السيارات

source: Jazz Music
ar: موسيقى الجاز

source: Wine
ar: نبيد

source: Performing Arts
ar: الفن التمثيلي

source: Cats
ar: القطط

source: Bollywood Movies
ar: أفلام بوليوود

source: Comedy Movies
ar: أفلام كوميدية

source: College Football
ar: الكلية لكرة القدم

source: TV Talk Shows
ar: برامج الدردشة التلفزيونية

source: TV Programs
ar: برنامج تلفزيوني

source: Cars
ar: السيارات

source: Fine Arts
ar: فن راقي

source: Dresses
ar: فساتين

source: Dance Music
ar: موسيقى الرقص

source: Dishes
ar: أطباق

# rhythm_blues_music
source: Rhythm and Blues Music
ar: موسيقى الإيقاع والبلوز

source: Bars
ar: الحانات

source: Fish
ar: سمك

source: Change Password
ar: تغيير كلمة المرور

source: Current Password
ar: كلمة السر الحالية

source: New Password
ar: كلمة السر الجديدة

source: Confirm New Password
ar: تأكيد كلمة السر الجديدة

source: Save Password
ar: حفظ كلمة السر

# error_empty_fields
source: Please enter all fields
ar: الرجاء إدخال جميع الحقول

# error_short_password
source: Password must be at least 6 characters
ar: كلمة السر يجب أن لا تقل عن 6 أحرف

# error_password_mismatch
source: Password and confirmation password do not match
ar: كلمة السر وتأكيد كلمة السر غير متطابقتين

# error_update_password
source: Failed to update password: {error}
ar: فشل تحديث كلمة السر: {error}

# success_update_password
source: Password updated successfully
ar: تم تحديث كلمة السر بنجاح

# faq_question_1
source: What is Bird App?
ar: ما هو تطبيق بيرد؟

# faq_question_2
source: How to create an ad?
ar: ازاي اعمل اعلان؟

# faq_question_3
source: How to recharge my wallet?
ar: ازاي اشحن رصيد محفظتي؟

# faq_question_4
source: How to achieve the best results for the ad?
ar: ازاي تحقق أفضل نتائج للإعلان؟

# faq_question_5
source: Why was my ad rejected?
ar: ليه اعلاني اترفض؟

# faq_question_6
source: Can I withdraw my wallet balance?
ar: اقدر اسحب رصيد محفظتي؟

# faq_question_7
source: What are the available offers or codes?
ar: ايه هي العروض او الاكواد المتاحة؟

# faq_question_8
source: The ad ended and the balance did not appear in the Bird App wallet
ar: تم انتهاء الاعلان والرصيد لم يظهر في محفظة تطبيق بيرد

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Email
ar: البريد الإلكتروني

source: Phone
ar: رقم الهاتف

source: Password
ar: كلمة المرور

source: Update
ar: تحديث

source: Save Changes
ar: حفظ التغييرات

# snack_bar_message
source: Changes saved successfully
ar: تم حفظ التغيير

# contact_phone
source: Contact via phone
ar: التواصل عبر الهاتف

# contact_whatsapp
source: Contact via WhatsApp
ar: التواصل عبر الواتس اب

# contact_messenger
source: Contact via Messenger
ar: التواصل عبر الماسنجر

# contact_email
source: Contact via Email
ar: التواصل عبر الاميل

source: Complaints and Suggestions
ar: الشكاوي والمقترحات

# leave_phone_for_contact
source: Please leave your phone number for contact regarding the complaint
ar: برجاء ترك رقم الهاتف للتواصل بخصوص الشكوي

source: Phone Number
ar: رقم الهاتف

# enter_complaint_here
source: Enter your complaint here
ar: اكتب شكواك هنا

source: Send
ar: إرسال

source: Complaint Sent
ar: تم ارسال الشكوي

# thank_you_complaint_sent
source: Thank you. Your complaint has been sent successfully.
ar: شكراً لك. تم ارسال الشكوي بنجاح.

source: Balance Amount
ar: مبلغ الرصيد

source: Enter amount
ar: أدخل المبلغ

source: Note
ar: ملحوظة

# minimum_ad_amount
source: The minimum amount to run an ad is 200 EGP.
ar: الحد الأدنى لتشغيل إعلان هو 200 ج.م.

source: Payment Details
ar: تفاصيل الدفع

source: Charging Amount
ar: مبلغ الشحن

source: VAT 14%
ar: ضريبة القيمة المضافة 14%

source: Charging Value
ar: قيمة الشحن

# continue_action
source: Continue
ar: استمر

# continue_text
source: Continue
ar: استمرار

# enter_coupon
source: Enter Coupon Code
ar: ادخل كود الخصم

# apply_coupon
source: Apply
ar: استخدام

# coupon_message
source: If you have a gift code, enter it here to get free ad credit (coupon one time use)
ar: لو معاك كود هدية اكتبه هنا علشان تاخد رصيد إعلانات مجاني (الكود يستخدم مرة واحدة فقط)

source: Invalid coupon
ar: الكوبون غير صالح

# used_coupon
source: This coupon has already been used
ar: هذا الكوبون مستخدم من قبل

# applied_coupon
source: You have received an amount of {couponValue} EGP
ar: تم الحصول على مبلغ {couponValue} ج.م

# balance_0
source: 0 EGP
ar: 0 ج.م

# currency
source: EGP
ar: ج.م

# no_transactions
source: No transactions currently
ar: لا توجد معاملات حالياً

source: Coupon added
ar: تم إضافة كوبون

source: Ad cost
ar: تكلفة إعلان

source: Balance Added
ar: تم إضافة رصيد

# balance_added_auto
source: Balance Added Automatically
ar: تم إضافة رصيد تلقائيًا

source: Available Balance
ar: المبلغ المتاح للإرجاع

source: Refund Amount
ar: المبلغ المطلوب استرداده

source: Refund Method
ar: طريقة الاسترداد

source: Account Number
ar: رقم الحساب

source: Refund Reason
ar: سبب الاسترداد

source: Other Reason
ar: أخرى

source: Submit Request
ar: إرسال الطلب

# success_message
source: Your request has been submitted successfully
ar: تم ارسال طلبك بنجاح

source: Transfer via Vodafone Cash
ar: التحويل عبر فودافون كاش

source: Transfer via Instapay
ar: التحويل عبر انستا باي

source: Amount
ar: المبلغ

# attachment_note
source: Please attach a screenshot of the transfer
ar: برجاء ارسال صورة في التحويل في المرفقات

source: Submit
ar: إرسال

# upload_success
source: File uploaded successfully
ar: تم رفع الملف بنجاح

# upload_failure
source: File upload failed
ar: فشل رفع الملف

source: Cash Wallet
ar: محفظة الكاش

source: Insta Pay
ar: انستا باي

# service_not_liked
source: Didn't like the service
ar: لم تعجبني الخدمة

source: Charged by mistake
ar: شحن عن طريق الخطأ

source: Want to stop for a while
ar: أود التوقف لفترة

source: Not suitable for my work
ar: غير مناسب لعملي

# results_not_liked
source: Didn't like the results
ar: النتائج لم تعجبني

source: Uploading
ar: جاري التحميل

source: New Transfer
ar: تحويل جديد

# notification_message
source: Your request for adding funds is in progress
ar: طلبكم بإضافة الأموال قيد التنفيذ

source: Request Received
ar: تم استلام طلبكم

# follow_balance
source: Your order will be processed within 2 working hours. Please check the balance
ar: سيتم تنفيذ الامر خلال ساعتين عمل برجاء متابعة الرصيد

# data_save_failure
source: Error occurred while saving data
ar: حدث خطأ أثناء حفظ البيانات

# choose_transfer_method
source: Please choose a transfer method
ar: برجاء اختيار طريقة التحويل

# transfer_note
source: Note: You can transfer from any e-wallet
ar: ملاحظة: تقدر تحول من أي محفظة إلكترونية

# transfer_note_instapay
source: Note: The name 'Rady' will appear
ar: ملاحظة: سيظهر الاسم Rady

# transfer_note_input
source: Please enter the transfer number or Instapay name
ar: برجاء كتابة الرقم المحول منه أو اسم الانستا باي المحول منه

# transfer_note_error
source: Please enter the transfer number or Instapay name
ar: برجاء كتابة الرقم المحول منه أو اسم الانستا باي المحول منه

# copied
source: Number copied
ar: تم نسخ الرقم

source: Copy
ar: نسخ

# reset_password_title
source: Forgot Password
ar: نسيت كلمة المرور

# reset_password_instruction
source: Please enter your email to receive the password reset code.
ar: من فضلك أدخل بريدك الإلكتروني لتلقي رمز إعادة تعيين كلمة المرور.

# reset_password_button
source: Reset Password
ar: إعادة تعيين كلمة المرور

# email_label
source: Email
ar: البريد الإلكتروني

# invalid_email
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

# email_not_registered
source: The email is not registered with us. Please create a new account.
ar: البريد الإلكتروني غير مسجل لدينا. برجاء إنشاء حساب جديد.

source: Verification code sent.
ar: تم إرسال رمز التحقق.

# verification_code_error
source: An error occurred while sending the verification code.
ar: حدث خطأ أثناء إرسال رمز التحقق.

# reset_password_error
source: An error occurred while sending the password reset link: {errorMessage}
ar: حدث خطأ أثناء إرسال رابط إعادة تعيين كلمة المرور: {errorMessage}

# unexpected_error
source: An unexpected error occurred while sending the password reset link
ar: حدث خطأ غير متوقع أثناء إرسال رابط إعادة تعيين كلمة المرور

source: Error updating Firestore:
ar: حدث خطأ أثناء تحديث Firestore:

# error_user_null
source: Error: user is null
ar: خطأ: المستخدم غير موجود

source: Home
ar: الرئيسية

source: Start with Bird
ar: ابدأ مع بيرد

source: Start
ar: ابدأ

source: Our Other Services
ar: خدماتنا الأخرى

source: Browse Our Services
ar: استعرض خدماتنا

source: View all our other services
ar: استعرض كل خدماتنا الأخرى

source: Login
ar: تسجيل الدخول

source: Remember me
ar: تذكرني

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Register
ar: إنشاء حساب جديد

# login_error_empty_fields
source: Please enter all fields
ar: الرجاء إدخال جميع الحقول

# login_error_invalid_email
source: Please enter a valid email
ar: برجاء كتابة البريد الإلكتروني بشكل صحيح

# login_error_short_password
source: Password must be at least 6 characters
ar: كلمة السر يجب أن لا تقل عن 6 أحرف

# login_error
source: An error occurred while logging in
ar: حدث خطأ أثناء تسجيل الدخول

source: Skip
ar: تخطي

source: Welcome
ar: أهلاً بك

# enter_email_and_password
source: Please enter your email and password to enjoy our services.
ar: الرجاء إدخال البريد الإلكتروني وكلمة المرور للاستمتاع بخدماتنا.

source: Login successful
ar: تم تسجيل الدخول بنجاح

source: User not found
ar: لم يتم العثور على المستخدم

source: User disabled
ar: هذا المستخدم معطل

source: Wrong password
ar: كلمة السر غير صحيحة

# unknown_error
source: An unknown error occurred
ar: حدث خطأ غير معروف

source: No notifications
ar: لا توجد إشعارات

source: Notifications
ar: الإشعارات

# error_currentAdId_not_found
source: Error: currentAdId not found in user document
ar: خطأ: لم يتم العثور على currentAdId في مستند المستخدم

source: Create New Account
ar: إنشاء حساب جديد

source: Confirm Password
ar: تأكيد كلمة المرور

source: Please enter all fields
ar: الرجاء إدخال جميع الحقول

# please_enter_valid_phone
source: Please enter a valid phone number
ar: برجاء كتابة رقم الهاتف بشكل صحيح

# please_enter_valid_email
source: Please enter a valid email address
ar: برجاء كتابة البريد الإلكتروني بشكل صحيح

# password_too_short
source: Password must be at least 6 characters
ar: كلمة السر يجب أن لا تقل عن 6 أحرف

# passwords_do_not_match
source: Password and confirm password do not match
ar: كلمة السر وتأكيد كلمة السر غير متطابقتين

# weak_password
source: The password is too weak
ar: كلمة السر ضعيفة جدا

# email_already_in_use
source: An account already exists for this email
ar: الحساب موجود بالفعل لهذا البريد الإلكتروني

# error_registering
source: Error registering: {message}
ar: حدث خطأ أثناء التسجيل: {message}

source: Other Services
ar: خدمات بيرد الأخرى

# ad_services
source: Sponsored ads for all platforms within the app
ar: إعلانات ممولة لكل المنصات داخل التطبيق

# design_services
source: Create professional designs
ar: إنشاء تصميمات احترفية

# creative_content
source: Create creative content
ar: إنشاء محتوي ابداعي

# ready_facebook_pages
source: Ready-made Facebook pages
ar: صفحات فيس بوك جاهزة

# facebook_followers
source: Increase Facebook followers
ar: تزويد صفحات الفيس بوك

# comments_likes
source: Increase comments, likes, and ratings on Facebook page
ar: تزويد كومنتات ولايكات وتقييمات علي صفحة فيس بوك

# instagram_accounts
source: Increase Instagram accounts
ar: تزويد اكونتات انستجرام

source: Ready Instagram accounts
ar: اكونتات انستجرام جاهزة

source: Ready TikTok accounts
ar: اكونتات تيك توك جاهزة

# request_services
source: Click here to request services
ar: لطلب الخدمات اضغط هنا

# order_service
source: Order the service
ar: اطلب الخدمة

# ad_platforms
source: Facebook - Instagram - TikTok - YouTube - Google
ar: فيس بوك - انستجرام - تيك توك - يوتيوب - جوجل

# design_examples
source: Social Media Post - Menu - Signage - etc.
ar: بوست سوشيال ميديا - منيو - يافطة - الخ

# ai_collaboration
source: In collaboration with AI
ar: بالتعاون مع الذكاء الاصطناعي

# price_based_on_followers
source: Price depends on the number and starts from 5k followers
ar: يحدد السعر حسب العدد وتبدء من 5 الف متابع

# real_engaged_people
source: Real and engaged people
ar: اشخاص حقيقية ومتفاعلة

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Enter New Password
ar: أدخل كلمة المرور الجديدة

# error_passwords_not_matching
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# success_password_reset
source: Password reset successfully
ar: تم تغيير كلمة المرور بنجاح

source: Verify Code
ar: التحقق من الرمز

# enter_six_digit_code
source: Enter the 6-digit code sent to {email}
ar: أدخل الرمز المكون من 6 أرقام المرسل إلى {email}

source: Code
ar: الرمز

source: Verify
ar: تحقق

# invalid_code
source: The code is incorrect. Try again.
ar: الرمز غير صحيح. حاول مرة أخرى.

# code_verified
source: Code verified successfully. You can now reset your password.
ar: تم التحقق من الرمز بنجاح. يمكنك الآن إعادة تعيين كلمة المرور.

# error_empty_code
source: Please enter the 6-digit code
ar: الرجاء إدخال الرمز المكون من 6 أرقام

# enter_new_password_instructions
source: Please enter and confirm your new password.
ar: الرجاء إدخال وتأكيد كلمة المرور الجديدة.

# error_email_not_registered
source: The email is not registered with us.
ar: البريد الإلكتروني غير مسجل لدينا.

# error_updating_password
source: An error occurred while updating the password
ar: حدث خطأ أثناء تحديث كلمة المرور

# error_occurred
source: An error occurred
ar: حدث خطأ

# error_unexpected
source: An unexpected error occurred while updating the password
ar: حدث خطأ غير متوقع أثناء تحديث كلمة المرور

source: Delete
ar: حذف

source: Advertisements
ar: الإعلانات

source: Active Ads
ar: الإعلانات النشطة

source: Loading ads...
ar: جاري تحميل الإعلانات...

source: No ads found
ar: لا يوجد إعلانات

# stop_ad_request_sent
source: Ad stop request sent. It will be stopped within 2 working hours.
ar: تم إرسال طلب إيقاف الإعلان. سيتم الإيقاف خلال ساعتين عمل.

# error_loading_ads
source: Error loading ads: {error}
ar: حدث خطأ أثناء تحميل الإعلانات: {error}

source: Ad Details
ar: تفاصيل الإعلان

source: Stop Ad Request
ar: طلب إيقاف الإعلان

source: Ad Results
ar: نتائج الإعلان

source: Increase Ad
ar: تزويد الإعلان

source: Increase Budget
ar: تزويد الميزانية

source: Enter budget
ar: أدخل الميزانية

# enter_days
source: Enter number of days
ar: أدخل عدد الايام

# budget_error_message
source: Your current balance is {balance} EGP. Please recharge to continue the ad.
ar: رصيدك الحالي هو {balance} ج.م. برجاء الشحن لاستكمال الإعلان.

# increase_request_sent
source: The request to increase the ad by {budget} EGP and {days} days has been sent. It will be processed within 2 business hours.
ar: تم إرسال طلب التزويد بقيمة {budget} ج.م وعدد {days} أيام. سيتم تنفيذ الطلب خلال ساعتين عمل.

source: Facebook Ads
ar: إعلانات فيسبوك

source: All Ads
ar: جميع الإعلانات

source: Stopped Ads
ar: الإعلانات المتوقفة

# ad_results_text
source: You can track the ad from the Ad Center.
ar: تقدر تتابع الإعلان من مركز الإعلانات.

source: Platform
ar: المنصة

source: Gender
ar: النوع

source: Age
ar: العمر

source: Budget
ar: الميزانية

source: Duration
ar: المدة

source: Country
ar: الدولة
